sownlee/MCAL/env/STM32F407VG/header/Header_SYSTEM.h
#if !defined(HEADER_SYSTEM_H_)  
#define HEADER_SYSTEM_H_

#include "Header.h"

/*Define register for EXIT*/
typedef struct
{
	__IO uint32_t IMR;	 /* Interrupt mask register (EXTI_IMR)        	   */
	__IO uint32_t EMR;	 /* Event mask register (EXTI_EMR)                 */
	__IO uint32_t RTSR;	 /* Rising trigger selection register (EXTI_RTSR)	 */
	__IO uint32_t FTSR;	 /* Falling trigger selection register (EXTI_FTSR) */
	__IO uint32_t SWIER; /* Software interrupt event register (EXTI_SWIER) */
	__IO uint32_t PR;	   /* Pending register (EXTI_PR)                   	 */

} EXTI_RegDef_t;
#define EXTI ((EXTI_RegDef_t *)EXTI_BASEADDR)

/*Define register for  SYSCFG*/
typedef struct
{
	__IO uint32_t MEMRMP;	   /* SYSCFG memory remap register (SYSCFG_MEMRMP)                    */
	__IO uint32_t PMC;		   /* SYSCFG peripheral mode configuration register     		          */
	__IO uint32_t EXTICR[4]; /* SYSCFG external interrupt configuration register 1, 2,  3, 4 	  */
	uint32_t RESERVED1[2];	 /* Reserved, 0x18-0x1C    	                                        */
	__IO uint32_t CMPCR;	   /* Compensation cell control register (SYSCFG_CMPCR)               */
	uint32_t RESERVED2[2];	 /* Reserved, 0x24-0x28 	                                          */
	__IO uint32_t CFGR;		   /*                                                              	  */
} SYSCFG_RegDef_t;
#define SYSCFG ((SYSCFG_RegDef_t *)SYSCFG_BASEADDR)


/******************  Bits definition for EXTI_IMR register  ***************/
#define EXTI_IMR_MR0_Pos          (0U)                                         
#define EXTI_IMR_MR0_Msk          (0x1UL << EXTI_IMR_MR0_Pos)                 
#define EXTI_IMR_MR0              EXTI_IMR_MR0_Msk                            
#define EXTI_IMR_MR1_Pos          (1U)                                        
#define EXTI_IMR_MR1_Msk          (0x1UL << EXTI_IMR_MR1_Pos)                 
#define EXTI_IMR_MR1              EXTI_IMR_MR1_Msk                            
#define EXTI_IMR_MR2_Pos          (2U)                                        
#define EXTI_IMR_MR2_Msk          (0x1UL << EXTI_IMR_MR2_Pos)                 
#define EXTI_IMR_MR2              EXTI_IMR_MR2_Msk                            
#define EXTI_IMR_MR3_Pos          (3U)                                        
#define EXTI_IMR_MR3_Msk          (0x1UL << EXTI_IMR_MR3_Pos)                 
#define EXTI_IMR_MR3              EXTI_IMR_MR3_Msk                            
#define EXTI_IMR_MR4_Pos          (4U)                                        
#define EXTI_IMR_MR4_Msk          (0x1UL << EXTI_IMR_MR4_Pos)                 
#define EXTI_IMR_MR4              EXTI_IMR_MR4_Msk                            
#define EXTI_IMR_MR5_Pos          (5U)                                        
#define EXTI_IMR_MR5_Msk          (0x1UL << EXTI_IMR_MR5_Pos)                 
#define EXTI_IMR_MR5              EXTI_IMR_MR5_Msk                            
#define EXTI_IMR_MR6_Pos          (6U)                                        
#define EXTI_IMR_MR6_Msk          (0x1UL << EXTI_IMR_MR6_Pos)                 
#define EXTI_IMR_MR6              EXTI_IMR_MR6_Msk                            
#define EXTI_IMR_MR7_Pos          (7U)                                        
#define EXTI_IMR_MR7_Msk          (0x1UL << EXTI_IMR_MR7_Pos)                 
#define EXTI_IMR_MR7              EXTI_IMR_MR7_Msk                            
#define EXTI_IMR_MR8_Pos          (8U)                                        
#define EXTI_IMR_MR8_Msk          (0x1UL << EXTI_IMR_MR8_Pos)                 
#define EXTI_IMR_MR8              EXTI_IMR_MR8_Msk                            
#define EXTI_IMR_MR9_Pos          (9U)                                        
#define EXTI_IMR_MR9_Msk          (0x1UL << EXTI_IMR_MR9_Pos)                 
#define EXTI_IMR_MR9              EXTI_IMR_MR9_Msk                            
#define EXTI_IMR_MR10_Pos         (10U)                                       
#define EXTI_IMR_MR10_Msk         (0x1UL << EXTI_IMR_MR10_Pos)                
#define EXTI_IMR_MR10             EXTI_IMR_MR10_Msk                           
#define EXTI_IMR_MR11_Pos         (11U)                                        
#define EXTI_IMR_MR11_Msk         (0x1UL << EXTI_IMR_MR11_Pos)               
#define EXTI_IMR_MR11             EXTI_IMR_MR11_Msk                          
#define EXTI_IMR_MR12_Pos         (12U)                                      
#define EXTI_IMR_MR12_Msk         (0x1UL << EXTI_IMR_MR12_Pos)               
#define EXTI_IMR_MR12             EXTI_IMR_MR12_Msk                          
#define EXTI_IMR_MR13_Pos         (13U)                                      
#define EXTI_IMR_MR13_Msk         (0x1UL << EXTI_IMR_MR13_Pos)               
#define EXTI_IMR_MR13             EXTI_IMR_MR13_Msk                          
#define EXTI_IMR_MR14_Pos         (14U)                                      
#define EXTI_IMR_MR14_Msk         (0x1UL << EXTI_IMR_MR14_Pos)               
#define EXTI_IMR_MR14             EXTI_IMR_MR14_Msk                          
#define EXTI_IMR_MR15_Pos         (15U)                                      
#define EXTI_IMR_MR15_Msk         (0x1UL << EXTI_IMR_MR15_Pos)               
#define EXTI_IMR_MR15             EXTI_IMR_MR15_Msk                          
#define EXTI_IMR_MR16_Pos         (16U)                                      
#define EXTI_IMR_MR16_Msk         (0x1UL << EXTI_IMR_MR16_Pos)               
#define EXTI_IMR_MR16             EXTI_IMR_MR16_Msk                          
#define EXTI_IMR_MR17_Pos         (17U)                                      
#define EXTI_IMR_MR17_Msk         (0x1UL << EXTI_IMR_MR17_Pos)               
#define EXTI_IMR_MR17             EXTI_IMR_MR17_Msk                          
#define EXTI_IMR_MR18_Pos         (18U)                                      
#define EXTI_IMR_MR18_Msk         (0x1UL << EXTI_IMR_MR18_Pos)               
#define EXTI_IMR_MR18             EXTI_IMR_MR18_Msk                          
#define EXTI_IMR_MR19_Pos         (19U)                                      
#define EXTI_IMR_MR19_Msk         (0x1UL << EXTI_IMR_MR19_Pos)               
#define EXTI_IMR_MR19             EXTI_IMR_MR19_Msk                          
#define EXTI_IMR_MR20_Pos         (20U)                                      
#define EXTI_IMR_MR20_Msk         (0x1UL << EXTI_IMR_MR20_Pos)               
#define EXTI_IMR_MR20             EXTI_IMR_MR20_Msk                          
#define EXTI_IMR_MR21_Pos         (21U)                                      
#define EXTI_IMR_MR21_Msk         (0x1UL << EXTI_IMR_MR21_Pos)               
#define EXTI_IMR_MR21             EXTI_IMR_MR21_Msk                          
#define EXTI_IMR_MR22_Pos         (22U)                                      
#define EXTI_IMR_MR22_Msk         (0x1UL << EXTI_IMR_MR22_Pos)               
#define EXTI_IMR_MR22             EXTI_IMR_MR22_Msk                          

/* Reference Defines */
#define  EXTI_IMR_IM0                        EXTI_IMR_MR0
#define  EXTI_IMR_IM1                        EXTI_IMR_MR1
#define  EXTI_IMR_IM2                        EXTI_IMR_MR2
#define  EXTI_IMR_IM3                        EXTI_IMR_MR3
#define  EXTI_IMR_IM4                        EXTI_IMR_MR4
#define  EXTI_IMR_IM5                        EXTI_IMR_MR5
#define  EXTI_IMR_IM6                        EXTI_IMR_MR6
#define  EXTI_IMR_IM7                        EXTI_IMR_MR7
#define  EXTI_IMR_IM8                        EXTI_IMR_MR8
#define  EXTI_IMR_IM9                        EXTI_IMR_MR9
#define  EXTI_IMR_IM10                       EXTI_IMR_MR10
#define  EXTI_IMR_IM11                       EXTI_IMR_MR11
#define  EXTI_IMR_IM12                       EXTI_IMR_MR12
#define  EXTI_IMR_IM13                       EXTI_IMR_MR13
#define  EXTI_IMR_IM14                       EXTI_IMR_MR14
#define  EXTI_IMR_IM15                       EXTI_IMR_MR15
#define  EXTI_IMR_IM16                       EXTI_IMR_MR16
#define  EXTI_IMR_IM17                       EXTI_IMR_MR17
#define  EXTI_IMR_IM18                       EXTI_IMR_MR18
#define  EXTI_IMR_IM19                       EXTI_IMR_MR19
#define  EXTI_IMR_IM20                       EXTI_IMR_MR20
#define  EXTI_IMR_IM21                       EXTI_IMR_MR21
#define  EXTI_IMR_IM22                       EXTI_IMR_MR22
#define EXTI_IMR_IM_Pos           (0U)                                         
#define EXTI_IMR_IM_Msk           (0x7FFFFFUL << EXTI_IMR_IM_Pos)             
#define EXTI_IMR_IM               EXTI_IMR_IM_Msk                             

/*******************  Bit definition for EXTI_EMR register  *******************/
#define EXTI_EMR_MR0_Pos          (0U)                                         
#define EXTI_EMR_MR0_Msk          (0x1UL << EXTI_EMR_MR0_Pos)                
#define EXTI_EMR_MR0              EXTI_EMR_MR0_Msk                           
#define EXTI_EMR_MR1_Pos          (1U)                                       
#define EXTI_EMR_MR1_Msk          (0x1UL << EXTI_EMR_MR1_Pos)                
#define EXTI_EMR_MR1              EXTI_EMR_MR1_Msk                           
#define EXTI_EMR_MR2_Pos          (2U)                                       
#define EXTI_EMR_MR2_Msk          (0x1UL << EXTI_EMR_MR2_Pos)                
#define EXTI_EMR_MR2              EXTI_EMR_MR2_Msk                           
#define EXTI_EMR_MR3_Pos          (3U)                                       
#define EXTI_EMR_MR3_Msk          (0x1UL << EXTI_EMR_MR3_Pos)                
#define EXTI_EMR_MR3              EXTI_EMR_MR3_Msk                           
#define EXTI_EMR_MR4_Pos          (4U)                                       
#define EXTI_EMR_MR4_Msk          (0x1UL << EXTI_EMR_MR4_Pos)                
#define EXTI_EMR_MR4              EXTI_EMR_MR4_Msk                           
#define EXTI_EMR_MR5_Pos          (5U)                                       
#define EXTI_EMR_MR5_Msk          (0x1UL << EXTI_EMR_MR5_Pos)                
#define EXTI_EMR_MR5              EXTI_EMR_MR5_Msk                           
#define EXTI_EMR_MR6_Pos          (6U)                                       
#define EXTI_EMR_MR6_Msk          (0x1UL << EXTI_EMR_MR6_Pos)                
#define EXTI_EMR_MR6              EXTI_EMR_MR6_Msk                           
#define EXTI_EMR_MR7_Pos          (7U)                                       
#define EXTI_EMR_MR7_Msk          (0x1UL << EXTI_EMR_MR7_Pos)               
#define EXTI_EMR_MR7              EXTI_EMR_MR7_Msk                          
#define EXTI_EMR_MR8_Pos          (8U)                                      
#define EXTI_EMR_MR8_Msk          (0x1UL << EXTI_EMR_MR8_Pos)               
#define EXTI_EMR_MR8              EXTI_EMR_MR8_Msk                          
#define EXTI_EMR_MR9_Pos          (9U)                                      
#define EXTI_EMR_MR9_Msk          (0x1UL << EXTI_EMR_MR9_Pos)               
#define EXTI_EMR_MR9              EXTI_EMR_MR9_Msk                          
#define EXTI_EMR_MR10_Pos         (10U)                                     
#define EXTI_EMR_MR10_Msk         (0x1UL << EXTI_EMR_MR10_Pos)              
#define EXTI_EMR_MR10             EXTI_EMR_MR10_Msk                         
#define EXTI_EMR_MR11_Pos         (11U)                                     
#define EXTI_EMR_MR11_Msk         (0x1UL << EXTI_EMR_MR11_Pos)              
#define EXTI_EMR_MR11             EXTI_EMR_MR11_Msk                         
#define EXTI_EMR_MR12_Pos         (12U)                                     
#define EXTI_EMR_MR12_Msk         (0x1UL << EXTI_EMR_MR12_Pos)              
#define EXTI_EMR_MR12             EXTI_EMR_MR12_Msk                         
#define EXTI_EMR_MR13_Pos         (13U)                                     
#define EXTI_EMR_MR13_Msk         (0x1UL << EXTI_EMR_MR13_Pos)              
#define EXTI_EMR_MR13             EXTI_EMR_MR13_Msk                         
#define EXTI_EMR_MR14_Pos         (14U)                                     
#define EXTI_EMR_MR14_Msk         (0x1UL << EXTI_EMR_MR14_Pos)              
#define EXTI_EMR_MR14             EXTI_EMR_MR14_Msk                         
#define EXTI_EMR_MR15_Pos         (15U)                                     
#define EXTI_EMR_MR15_Msk         (0x1UL << EXTI_EMR_MR15_Pos)              
#define EXTI_EMR_MR15             EXTI_EMR_MR15_Msk                         
#define EXTI_EMR_MR16_Pos         (16U)                                     
#define EXTI_EMR_MR16_Msk         (0x1UL << EXTI_EMR_MR16_Pos)              
#define EXTI_EMR_MR16             EXTI_EMR_MR16_Msk                         
#define EXTI_EMR_MR17_Pos         (17U)                                     
#define EXTI_EMR_MR17_Msk         (0x1UL << EXTI_EMR_MR17_Pos)              
#define EXTI_EMR_MR17             EXTI_EMR_MR17_Msk                         
#define EXTI_EMR_MR18_Pos         (18U)                                     
#define EXTI_EMR_MR18_Msk         (0x1UL << EXTI_EMR_MR18_Pos)              
#define EXTI_EMR_MR18             EXTI_EMR_MR18_Msk                         
#define EXTI_EMR_MR19_Pos         (19U)                                     
#define EXTI_EMR_MR19_Msk         (0x1UL << EXTI_EMR_MR19_Pos)              
#define EXTI_EMR_MR19             EXTI_EMR_MR19_Msk                         
#define EXTI_EMR_MR20_Pos         (20U)                                     
#define EXTI_EMR_MR20_Msk         (0x1UL << EXTI_EMR_MR20_Pos)              
#define EXTI_EMR_MR20             EXTI_EMR_MR20_Msk                         
#define EXTI_EMR_MR21_Pos         (21U)                                      
#define EXTI_EMR_MR21_Msk         (0x1UL << EXTI_EMR_MR21_Pos)               
#define EXTI_EMR_MR21             EXTI_EMR_MR21_Msk                          
#define EXTI_EMR_MR22_Pos         (22U)                                      
#define EXTI_EMR_MR22_Msk         (0x1UL << EXTI_EMR_MR22_Pos)               
#define EXTI_EMR_MR22             EXTI_EMR_MR22_Msk                          

/* Reference Defines */
#define  EXTI_EMR_EM0                        EXTI_EMR_MR0
#define  EXTI_EMR_EM1                        EXTI_EMR_MR1
#define  EXTI_EMR_EM2                        EXTI_EMR_MR2
#define  EXTI_EMR_EM3                        EXTI_EMR_MR3
#define  EXTI_EMR_EM4                        EXTI_EMR_MR4
#define  EXTI_EMR_EM5                        EXTI_EMR_MR5
#define  EXTI_EMR_EM6                        EXTI_EMR_MR6
#define  EXTI_EMR_EM7                        EXTI_EMR_MR7
#define  EXTI_EMR_EM8                        EXTI_EMR_MR8
#define  EXTI_EMR_EM9                        EXTI_EMR_MR9
#define  EXTI_EMR_EM10                       EXTI_EMR_MR10
#define  EXTI_EMR_EM11                       EXTI_EMR_MR11
#define  EXTI_EMR_EM12                       EXTI_EMR_MR12
#define  EXTI_EMR_EM13                       EXTI_EMR_MR13
#define  EXTI_EMR_EM14                       EXTI_EMR_MR14
#define  EXTI_EMR_EM15                       EXTI_EMR_MR15
#define  EXTI_EMR_EM16                       EXTI_EMR_MR16
#define  EXTI_EMR_EM17                       EXTI_EMR_MR17
#define  EXTI_EMR_EM18                       EXTI_EMR_MR18
#define  EXTI_EMR_EM19                       EXTI_EMR_MR19
#define  EXTI_EMR_EM20                       EXTI_EMR_MR20
#define  EXTI_EMR_EM21                       EXTI_EMR_MR21
#define  EXTI_EMR_EM22                       EXTI_EMR_MR22

/******************  Bit definition for EXTI_RTSR register  *******************/
#define EXTI_RTSR_TR0_Pos         (0U)                                         
#define EXTI_RTSR_TR0_Msk         (0x1UL << EXTI_RTSR_TR0_Pos)              
#define EXTI_RTSR_TR0             EXTI_RTSR_TR0_Msk                         
#define EXTI_RTSR_TR1_Pos         (1U)                                      
#define EXTI_RTSR_TR1_Msk         (0x1UL << EXTI_RTSR_TR1_Pos)              
#define EXTI_RTSR_TR1             EXTI_RTSR_TR1_Msk                         
#define EXTI_RTSR_TR2_Pos         (2U)                                      
#define EXTI_RTSR_TR2_Msk         (0x1UL << EXTI_RTSR_TR2_Pos)              
#define EXTI_RTSR_TR2             EXTI_RTSR_TR2_Msk                         
#define EXTI_RTSR_TR3_Pos         (3U)                                      
#define EXTI_RTSR_TR3_Msk         (0x1UL << EXTI_RTSR_TR3_Pos)              
#define EXTI_RTSR_TR3             EXTI_RTSR_TR3_Msk                         
#define EXTI_RTSR_TR4_Pos         (4U)                                      
#define EXTI_RTSR_TR4_Msk         (0x1UL << EXTI_RTSR_TR4_Pos)              
#define EXTI_RTSR_TR4             EXTI_RTSR_TR4_Msk                         
#define EXTI_RTSR_TR5_Pos         (5U)                                      
#define EXTI_RTSR_TR5_Msk         (0x1UL << EXTI_RTSR_TR5_Pos)              
#define EXTI_RTSR_TR5             EXTI_RTSR_TR5_Msk                         
#define EXTI_RTSR_TR6_Pos         (6U)                                      
#define EXTI_RTSR_TR6_Msk         (0x1UL << EXTI_RTSR_TR6_Pos)              
#define EXTI_RTSR_TR6             EXTI_RTSR_TR6_Msk                         
#define EXTI_RTSR_TR7_Pos         (7U)                                      
#define EXTI_RTSR_TR7_Msk         (0x1UL << EXTI_RTSR_TR7_Pos)              
#define EXTI_RTSR_TR7             EXTI_RTSR_TR7_Msk                         
#define EXTI_RTSR_TR8_Pos         (8U)                                      
#define EXTI_RTSR_TR8_Msk         (0x1UL << EXTI_RTSR_TR8_Pos)              
#define EXTI_RTSR_TR8             EXTI_RTSR_TR8_Msk                         
#define EXTI_RTSR_TR9_Pos         (9U)                                      
#define EXTI_RTSR_TR9_Msk         (0x1UL << EXTI_RTSR_TR9_Pos)              
#define EXTI_RTSR_TR9             EXTI_RTSR_TR9_Msk                         
#define EXTI_RTSR_TR10_Pos        (10U)                                     
#define EXTI_RTSR_TR10_Msk        (0x1UL << EXTI_RTSR_TR10_Pos)             
#define EXTI_RTSR_TR10            EXTI_RTSR_TR10_Msk                        
#define EXTI_RTSR_TR11_Pos        (11U)                                     
#define EXTI_RTSR_TR11_Msk        (0x1UL << EXTI_RTSR_TR11_Pos)             
#define EXTI_RTSR_TR11            EXTI_RTSR_TR11_Msk                        
#define EXTI_RTSR_TR12_Pos        (12U)                                     
#define EXTI_RTSR_TR12_Msk        (0x1UL << EXTI_RTSR_TR12_Pos)             
#define EXTI_RTSR_TR12            EXTI_RTSR_TR12_Msk                        
#define EXTI_RTSR_TR13_Pos        (13U)                                     
#define EXTI_RTSR_TR13_Msk        (0x1UL << EXTI_RTSR_TR13_Pos)             
#define EXTI_RTSR_TR13            EXTI_RTSR_TR13_Msk                        
#define EXTI_RTSR_TR14_Pos        (14U)                                     
#define EXTI_RTSR_TR14_Msk        (0x1UL << EXTI_RTSR_TR14_Pos)             
#define EXTI_RTSR_TR14            EXTI_RTSR_TR14_Msk                        
#define EXTI_RTSR_TR15_Pos        (15U)                                     
#define EXTI_RTSR_TR15_Msk        (0x1UL << EXTI_RTSR_TR15_Pos)             
#define EXTI_RTSR_TR15            EXTI_RTSR_TR15_Msk                        
#define EXTI_RTSR_TR16_Pos        (16U)                                     
#define EXTI_RTSR_TR16_Msk        (0x1UL << EXTI_RTSR_TR16_Pos)             
#define EXTI_RTSR_TR16            EXTI_RTSR_TR16_Msk                        
#define EXTI_RTSR_TR17_Pos        (17U)                                     
#define EXTI_RTSR_TR17_Msk        (0x1UL << EXTI_RTSR_TR17_Pos)             
#define EXTI_RTSR_TR17            EXTI_RTSR_TR17_Msk                        
#define EXTI_RTSR_TR18_Pos        (18U)                                     
#define EXTI_RTSR_TR18_Msk        (0x1UL << EXTI_RTSR_TR18_Pos)             
#define EXTI_RTSR_TR18            EXTI_RTSR_TR18_Msk                        
#define EXTI_RTSR_TR19_Pos        (19U)                                     
#define EXTI_RTSR_TR19_Msk        (0x1UL << EXTI_RTSR_TR19_Pos)             
#define EXTI_RTSR_TR19            EXTI_RTSR_TR19_Msk                        
#define EXTI_RTSR_TR20_Pos        (20U)                                     
#define EXTI_RTSR_TR20_Msk        (0x1UL << EXTI_RTSR_TR20_Pos)             
#define EXTI_RTSR_TR20            EXTI_RTSR_TR20_Msk                        
#define EXTI_RTSR_TR21_Pos        (21U)                                     
#define EXTI_RTSR_TR21_Msk        (0x1UL << EXTI_RTSR_TR21_Pos)             
#define EXTI_RTSR_TR21            EXTI_RTSR_TR21_Msk                        
#define EXTI_RTSR_TR22_Pos        (22U)                                     
#define EXTI_RTSR_TR22_Msk        (0x1UL << EXTI_RTSR_TR22_Pos)             
#define EXTI_RTSR_TR22            EXTI_RTSR_TR22_Msk                        

