sownlee/MCAL/env/STM32F407VG/header/Header_SYSTEM.h
/******************  Bit definition for EXTI_FTSR register  ****************/
#define EXTI_FTSR_TR0_Pos         (0U)                                      
#define EXTI_FTSR_TR0_Msk         (0x1UL << EXTI_FTSR_TR0_Pos)              
#define EXTI_FTSR_TR0             EXTI_FTSR_TR0_Msk                         
#define EXTI_FTSR_TR1_Pos         (1U)                                      
#define EXTI_FTSR_TR1_Msk         (0x1UL << EXTI_FTSR_TR1_Pos)              
#define EXTI_FTSR_TR1             EXTI_FTSR_TR1_Msk                         
#define EXTI_FTSR_TR2_Pos         (2U)                                      
#define EXTI_FTSR_TR2_Msk         (0x1UL << EXTI_FTSR_TR2_Pos)              
#define EXTI_FTSR_TR2             EXTI_FTSR_TR2_Msk                         
#define EXTI_FTSR_TR3_Pos         (3U)                                      
#define EXTI_FTSR_TR3_Msk         (0x1UL << EXTI_FTSR_TR3_Pos)              
#define EXTI_FTSR_TR3             EXTI_FTSR_TR3_Msk                         
#define EXTI_FTSR_TR4_Pos         (4U)                                      
#define EXTI_FTSR_TR4_Msk         (0x1UL << EXTI_FTSR_TR4_Pos)              
#define EXTI_FTSR_TR4             EXTI_FTSR_TR4_Msk                         
#define EXTI_FTSR_TR5_Pos         (5U)                                      
#define EXTI_FTSR_TR5_Msk         (0x1UL << EXTI_FTSR_TR5_Pos)              
#define EXTI_FTSR_TR5             EXTI_FTSR_TR5_Msk                         
#define EXTI_FTSR_TR6_Pos         (6U)                                      
#define EXTI_FTSR_TR6_Msk         (0x1UL << EXTI_FTSR_TR6_Pos)              
#define EXTI_FTSR_TR6             EXTI_FTSR_TR6_Msk                         
#define EXTI_FTSR_TR7_Pos         (7U)                                      
#define EXTI_FTSR_TR7_Msk         (0x1UL << EXTI_FTSR_TR7_Pos)              
#define EXTI_FTSR_TR7             EXTI_FTSR_TR7_Msk                         
#define EXTI_FTSR_TR8_Pos         (8U)                                      
#define EXTI_FTSR_TR8_Msk         (0x1UL << EXTI_FTSR_TR8_Pos)              
#define EXTI_FTSR_TR8             EXTI_FTSR_TR8_Msk                         
#define EXTI_FTSR_TR9_Pos         (9U)                                      
#define EXTI_FTSR_TR9_Msk         (0x1UL << EXTI_FTSR_TR9_Pos)              
#define EXTI_FTSR_TR9             EXTI_FTSR_TR9_Msk                         
#define EXTI_FTSR_TR10_Pos        (10U)                                     
#define EXTI_FTSR_TR10_Msk        (0x1UL << EXTI_FTSR_TR10_Pos)             
#define EXTI_FTSR_TR10            EXTI_FTSR_TR10_Msk                        
#define EXTI_FTSR_TR11_Pos        (11U)                                     
#define EXTI_FTSR_TR11_Msk        (0x1UL << EXTI_FTSR_TR11_Pos)             
#define EXTI_FTSR_TR11            EXTI_FTSR_TR11_Msk                        
#define EXTI_FTSR_TR12_Pos        (12U)                                     
#define EXTI_FTSR_TR12_Msk        (0x1UL << EXTI_FTSR_TR12_Pos)             
#define EXTI_FTSR_TR12            EXTI_FTSR_TR12_Msk                        
#define EXTI_FTSR_TR13_Pos        (13U)                                     
#define EXTI_FTSR_TR13_Msk        (0x1UL << EXTI_FTSR_TR13_Pos)             
#define EXTI_FTSR_TR13            EXTI_FTSR_TR13_Msk                        
#define EXTI_FTSR_TR14_Pos        (14U)                                     
#define EXTI_FTSR_TR14_Msk        (0x1UL << EXTI_FTSR_TR14_Pos)             
#define EXTI_FTSR_TR14            EXTI_FTSR_TR14_Msk                        
#define EXTI_FTSR_TR15_Pos        (15U)                                     
#define EXTI_FTSR_TR15_Msk        (0x1UL << EXTI_FTSR_TR15_Pos)             
#define EXTI_FTSR_TR15            EXTI_FTSR_TR15_Msk                        
#define EXTI_FTSR_TR16_Pos        (16U)                                     
#define EXTI_FTSR_TR16_Msk        (0x1UL << EXTI_FTSR_TR16_Pos)             
#define EXTI_FTSR_TR16            EXTI_FTSR_TR16_Msk                        
#define EXTI_FTSR_TR17_Pos        (17U)                                     
#define EXTI_FTSR_TR17_Msk        (0x1UL << EXTI_FTSR_TR17_Pos)             
#define EXTI_FTSR_TR17            EXTI_FTSR_TR17_Msk                        
#define EXTI_FTSR_TR18_Pos        (18U)                                     
#define EXTI_FTSR_TR18_Msk        (0x1UL << EXTI_FTSR_TR18_Pos)             
#define EXTI_FTSR_TR18            EXTI_FTSR_TR18_Msk                        
#define EXTI_FTSR_TR19_Pos        (19U)                                     
#define EXTI_FTSR_TR19_Msk        (0x1UL << EXTI_FTSR_TR19_Pos)             
#define EXTI_FTSR_TR19            EXTI_FTSR_TR19_Msk                        
#define EXTI_FTSR_TR20_Pos        (20U)                                     
#define EXTI_FTSR_TR20_Msk        (0x1UL << EXTI_FTSR_TR20_Pos)             
#define EXTI_FTSR_TR20            EXTI_FTSR_TR20_Msk                        
#define EXTI_FTSR_TR21_Pos        (21U)                                     
#define EXTI_FTSR_TR21_Msk        (0x1UL << EXTI_FTSR_TR21_Pos)             
#define EXTI_FTSR_TR21            EXTI_FTSR_TR21_Msk                        
#define EXTI_FTSR_TR22_Pos        (22U)                                     
#define EXTI_FTSR_TR22_Msk        (0x1UL << EXTI_FTSR_TR22_Pos)             
#define EXTI_FTSR_TR22            EXTI_FTSR_TR22_Msk                        

/******************  Bit definition for EXTI_SWIER register  ***************/
#define EXTI_SWIER_SWIER0_Pos     (0U)                                      
#define EXTI_SWIER_SWIER0_Msk     (0x1UL << EXTI_SWIER_SWIER0_Pos)          
#define EXTI_SWIER_SWIER0         EXTI_SWIER_SWIER0_Msk                     
#define EXTI_SWIER_SWIER1_Pos     (1U)                                      
#define EXTI_SWIER_SWIER1_Msk     (0x1UL << EXTI_SWIER_SWIER1_Pos)          
#define EXTI_SWIER_SWIER1         EXTI_SWIER_SWIER1_Msk                     
#define EXTI_SWIER_SWIER2_Pos     (2U)                                      
#define EXTI_SWIER_SWIER2_Msk     (0x1UL << EXTI_SWIER_SWIER2_Pos)          
#define EXTI_SWIER_SWIER2         EXTI_SWIER_SWIER2_Msk                     
#define EXTI_SWIER_SWIER3_Pos     (3U)                                      
#define EXTI_SWIER_SWIER3_Msk     (0x1UL << EXTI_SWIER_SWIER3_Pos)          
#define EXTI_SWIER_SWIER3         EXTI_SWIER_SWIER3_Msk                     
#define EXTI_SWIER_SWIER4_Pos     (4U)                                      
#define EXTI_SWIER_SWIER4_Msk     (0x1UL << EXTI_SWIER_SWIER4_Pos)          
#define EXTI_SWIER_SWIER4         EXTI_SWIER_SWIER4_Msk                     
#define EXTI_SWIER_SWIER5_Pos     (5U)                                      
#define EXTI_SWIER_SWIER5_Msk     (0x1UL << EXTI_SWIER_SWIER5_Pos)          
#define EXTI_SWIER_SWIER5         EXTI_SWIER_SWIER5_Msk                     
#define EXTI_SWIER_SWIER6_Pos     (6U)                                      
#define EXTI_SWIER_SWIER6_Msk     (0x1UL << EXTI_SWIER_SWIER6_Pos)          
#define EXTI_SWIER_SWIER6         EXTI_SWIER_SWIER6_Msk                     
#define EXTI_SWIER_SWIER7_Pos     (7U)                                      
#define EXTI_SWIER_SWIER7_Msk     (0x1UL << EXTI_SWIER_SWIER7_Pos)          
#define EXTI_SWIER_SWIER7         EXTI_SWIER_SWIER7_Msk                     
#define EXTI_SWIER_SWIER8_Pos     (8U)                                      
#define EXTI_SWIER_SWIER8_Msk     (0x1UL << EXTI_SWIER_SWIER8_Pos)          
#define EXTI_SWIER_SWIER8         EXTI_SWIER_SWIER8_Msk                     
#define EXTI_SWIER_SWIER9_Pos     (9U)                                      
#define EXTI_SWIER_SWIER9_Msk     (0x1UL << EXTI_SWIER_SWIER9_Pos)          
#define EXTI_SWIER_SWIER9         EXTI_SWIER_SWIER9_Msk                     
#define EXTI_SWIER_SWIER10_Pos    (10U)                                     
#define EXTI_SWIER_SWIER10_Msk    (0x1UL << EXTI_SWIER_SWIER10_Pos)         
#define EXTI_SWIER_SWIER10        EXTI_SWIER_SWIER10_Msk                    
#define EXTI_SWIER_SWIER11_Pos    (11U)                                     
#define EXTI_SWIER_SWIER11_Msk    (0x1UL << EXTI_SWIER_SWIER11_Pos)         
#define EXTI_SWIER_SWIER11        EXTI_SWIER_SWIER11_Msk                    
#define EXTI_SWIER_SWIER12_Pos    (12U)                                     
#define EXTI_SWIER_SWIER12_Msk    (0x1UL << EXTI_SWIER_SWIER12_Pos)         
#define EXTI_SWIER_SWIER12        EXTI_SWIER_SWIER12_Msk                    
#define EXTI_SWIER_SWIER13_Pos    (13U)                                     
#define EXTI_SWIER_SWIER13_Msk    (0x1UL << EXTI_SWIER_SWIER13_Pos)         
#define EXTI_SWIER_SWIER13        EXTI_SWIER_SWIER13_Msk                    
#define EXTI_SWIER_SWIER14_Pos    (14U)                                     
#define EXTI_SWIER_SWIER14_Msk    (0x1UL << EXTI_SWIER_SWIER14_Pos)         
#define EXTI_SWIER_SWIER14        EXTI_SWIER_SWIER14_Msk                    
#define EXTI_SWIER_SWIER15_Pos    (15U)                                     
#define EXTI_SWIER_SWIER15_Msk    (0x1UL << EXTI_SWIER_SWIER15_Pos)         
#define EXTI_SWIER_SWIER15        EXTI_SWIER_SWIER15_Msk                    
#define EXTI_SWIER_SWIER16_Pos    (16U)                                     
#define EXTI_SWIER_SWIER16_Msk    (0x1UL << EXTI_SWIER_SWIER16_Pos)         
#define EXTI_SWIER_SWIER16        EXTI_SWIER_SWIER16_Msk                    
#define EXTI_SWIER_SWIER17_Pos    (17U)                                     
#define EXTI_SWIER_SWIER17_Msk    (0x1UL << EXTI_SWIER_SWIER17_Pos)         
#define EXTI_SWIER_SWIER17        EXTI_SWIER_SWIER17_Msk                    
#define EXTI_SWIER_SWIER18_Pos    (18U)                                     
#define EXTI_SWIER_SWIER18_Msk    (0x1UL << EXTI_SWIER_SWIER18_Pos)         
#define EXTI_SWIER_SWIER18        EXTI_SWIER_SWIER18_Msk                    
#define EXTI_SWIER_SWIER19_Pos    (19U)                                     
#define EXTI_SWIER_SWIER19_Msk    (0x1UL << EXTI_SWIER_SWIER19_Pos)         
#define EXTI_SWIER_SWIER19        EXTI_SWIER_SWIER19_Msk                    
#define EXTI_SWIER_SWIER20_Pos    (20U)                                     
#define EXTI_SWIER_SWIER20_Msk    (0x1UL << EXTI_SWIER_SWIER20_Pos)         
#define EXTI_SWIER_SWIER20        EXTI_SWIER_SWIER20_Msk                    
#define EXTI_SWIER_SWIER21_Pos    (21U)                                     
#define EXTI_SWIER_SWIER21_Msk    (0x1UL << EXTI_SWIER_SWIER21_Pos)         
#define EXTI_SWIER_SWIER21        EXTI_SWIER_SWIER21_Msk                    
#define EXTI_SWIER_SWIER22_Pos    (22U)                                     
#define EXTI_SWIER_SWIER22_Msk    (0x1UL << EXTI_SWIER_SWIER22_Pos)         
#define EXTI_SWIER_SWIER22        EXTI_SWIER_SWIER22_Msk                    

/*******************  Bit definition for EXTI_PR register  ********************/
#define EXTI_PR_PR0_Pos           (0U)                                         
#define EXTI_PR_PR0_Msk           (0x1UL << EXTI_PR_PR0_Pos)                 
#define EXTI_PR_PR0               EXTI_PR_PR0_Msk                            
#define EXTI_PR_PR1_Pos           (1U)                                       
#define EXTI_PR_PR1_Msk           (0x1UL << EXTI_PR_PR1_Pos)                 
#define EXTI_PR_PR1               EXTI_PR_PR1_Msk                            
#define EXTI_PR_PR2_Pos           (2U)                                       
#define EXTI_PR_PR2_Msk           (0x1UL << EXTI_PR_PR2_Pos)                 
#define EXTI_PR_PR2               EXTI_PR_PR2_Msk                            
#define EXTI_PR_PR3_Pos           (3U)                                       
#define EXTI_PR_PR3_Msk           (0x1UL << EXTI_PR_PR3_Pos)                 
#define EXTI_PR_PR3               EXTI_PR_PR3_Msk                            
#define EXTI_PR_PR4_Pos           (4U)                                       
#define EXTI_PR_PR4_Msk           (0x1UL << EXTI_PR_PR4_Pos)                 
#define EXTI_PR_PR4               EXTI_PR_PR4_Msk                            
#define EXTI_PR_PR5_Pos           (5U)                                       
#define EXTI_PR_PR5_Msk           (0x1UL << EXTI_PR_PR5_Pos)                 
#define EXTI_PR_PR5               EXTI_PR_PR5_Msk                            
#define EXTI_PR_PR6_Pos           (6U)                                       
#define EXTI_PR_PR6_Msk           (0x1UL << EXTI_PR_PR6_Pos)                 
#define EXTI_PR_PR6               EXTI_PR_PR6_Msk                            
#define EXTI_PR_PR7_Pos           (7U)                                       
#define EXTI_PR_PR7_Msk           (0x1UL << EXTI_PR_PR7_Pos)                 
#define EXTI_PR_PR7               EXTI_PR_PR7_Msk                            
#define EXTI_PR_PR8_Pos           (8U)                                       
#define EXTI_PR_PR8_Msk           (0x1UL << EXTI_PR_PR8_Pos)                 
#define EXTI_PR_PR8               EXTI_PR_PR8_Msk                            
#define EXTI_PR_PR9_Pos           (9U)                                       
#define EXTI_PR_PR9_Msk           (0x1UL << EXTI_PR_PR9_Pos)                 
#define EXTI_PR_PR9               EXTI_PR_PR9_Msk                            
#define EXTI_PR_PR10_Pos          (10U)                                      
#define EXTI_PR_PR10_Msk          (0x1UL << EXTI_PR_PR10_Pos)                
#define EXTI_PR_PR10              EXTI_PR_PR10_Msk                           
#define EXTI_PR_PR11_Pos          (11U)                                      
#define EXTI_PR_PR11_Msk          (0x1UL << EXTI_PR_PR11_Pos)                
#define EXTI_PR_PR11              EXTI_PR_PR11_Msk                           
#define EXTI_PR_PR12_Pos          (12U)                                      
#define EXTI_PR_PR12_Msk          (0x1UL << EXTI_PR_PR12_Pos)                
#define EXTI_PR_PR12              EXTI_PR_PR12_Msk                           
#define EXTI_PR_PR13_Pos          (13U)                                      
#define EXTI_PR_PR13_Msk          (0x1UL << EXTI_PR_PR13_Pos)                
#define EXTI_PR_PR13              EXTI_PR_PR13_Msk                           
#define EXTI_PR_PR14_Pos          (14U)                                      
#define EXTI_PR_PR14_Msk          (0x1UL << EXTI_PR_PR14_Pos)                
#define EXTI_PR_PR14              EXTI_PR_PR14_Msk                           
#define EXTI_PR_PR15_Pos          (15U)                                      
#define EXTI_PR_PR15_Msk          (0x1UL << EXTI_PR_PR15_Pos)                
#define EXTI_PR_PR15              EXTI_PR_PR15_Msk                           
#define EXTI_PR_PR16_Pos          (16U)                                      
#define EXTI_PR_PR16_Msk          (0x1UL << EXTI_PR_PR16_Pos)                
#define EXTI_PR_PR16              EXTI_PR_PR16_Msk                           
#define EXTI_PR_PR17_Pos          (17U)                                      
#define EXTI_PR_PR17_Msk          (0x1UL << EXTI_PR_PR17_Pos)                
#define EXTI_PR_PR17              EXTI_PR_PR17_Msk                           
#define EXTI_PR_PR18_Pos          (18U)                                      
#define EXTI_PR_PR18_Msk          (0x1UL << EXTI_PR_PR18_Pos)                
#define EXTI_PR_PR18              EXTI_PR_PR18_Msk                           
#define EXTI_PR_PR19_Pos          (19U)                                      
#define EXTI_PR_PR19_Msk          (0x1UL << EXTI_PR_PR19_Pos)                
#define EXTI_PR_PR19              EXTI_PR_PR19_Msk                           
#define EXTI_PR_PR20_Pos          (20U)                                      
#define EXTI_PR_PR20_Msk          (0x1UL << EXTI_PR_PR20_Pos)                
#define EXTI_PR_PR20              EXTI_PR_PR20_Msk                           
#define EXTI_PR_PR21_Pos          (21U)                                      
#define EXTI_PR_PR21_Msk          (0x1UL << EXTI_PR_PR21_Pos)                
#define EXTI_PR_PR21              EXTI_PR_PR21_Msk                           
#define EXTI_PR_PR22_Pos          (22U)                                      
#define EXTI_PR_PR22_Msk          (0x1UL << EXTI_PR_PR22_Pos)                
#define EXTI_PR_PR22              EXTI_PR_PR22_Msk  

/******************  Bit definition for SYSCFG_MEMRMP register  ***************/
#define SYSCFG_MEMRMP_MEM_MODE_Pos           (0U)                              
#define SYSCFG_MEMRMP_MEM_MODE_Msk           (0x3UL << SYSCFG_MEMRMP_MEM_MODE_Pos) 
#define SYSCFG_MEMRMP_MEM_MODE               SYSCFG_MEMRMP_MEM_MODE_Msk       
#define SYSCFG_MEMRMP_MEM_MODE_0             (0x1UL << SYSCFG_MEMRMP_MEM_MODE_Pos) 
#define SYSCFG_MEMRMP_MEM_MODE_1             (0x2UL << SYSCFG_MEMRMP_MEM_MODE_Pos) 
/******************  Bit definition for SYSCFG_PMC register  ******************/
#define SYSCFG_PMC_MII_RMII_SEL_Pos          (23U)                             
#define SYSCFG_PMC_MII_RMII_SEL_Msk          (0x1UL << SYSCFG_PMC_MII_RMII_SEL_Pos)
#define SYSCFG_PMC_MII_RMII_SEL              SYSCFG_PMC_MII_RMII_SEL_Msk      
/* Old MII_RMII_SEL bit definition, maintained for legacy purpose */
#define SYSCFG_PMC_MII_RMII             SYSCFG_PMC_MII_RMII_SEL    

/*****************  Bit definition for SYSCFG_EXTICR1 register  ***************/
#define SYSCFG_EXTICR1_EXTI0_Pos             (0U)                              
#define SYSCFG_EXTICR1_EXTI0_Msk             (0xFUL << SYSCFG_EXTICR1_EXTI0_Pos) 
#define SYSCFG_EXTICR1_EXTI0                 SYSCFG_EXTICR1_EXTI0_Msk         
#define SYSCFG_EXTICR1_EXTI1_Pos             (4U)                              
#define SYSCFG_EXTICR1_EXTI1_Msk             (0xFUL << SYSCFG_EXTICR1_EXTI1_Pos)
#define SYSCFG_EXTICR1_EXTI1                 SYSCFG_EXTICR1_EXTI1_Msk         
#define SYSCFG_EXTICR1_EXTI2_Pos             (8U)                              
#define SYSCFG_EXTICR1_EXTI2_Msk             (0xFUL << SYSCFG_EXTICR1_EXTI2_Pos) 
#define SYSCFG_EXTICR1_EXTI2                 SYSCFG_EXTICR1_EXTI2_Msk          
#define SYSCFG_EXTICR1_EXTI3_Pos             (12U)                             
#define SYSCFG_EXTICR1_EXTI3_Msk             (0xFUL << SYSCFG_EXTICR1_EXTI3_Pos) 
#define SYSCFG_EXTICR1_EXTI3                 SYSCFG_EXTICR1_EXTI3_Msk  
/**       
  *    EXTI0 configuration  
  */
#define SYSCFG_EXTICR1_EXTI0_PA              0x0000U                         
#define SYSCFG_EXTICR1_EXTI0_PB              0x0001U                         
#define SYSCFG_EXTICR1_EXTI0_PC              0x0002U                         
#define SYSCFG_EXTICR1_EXTI0_PD              0x0003U                         
#define SYSCFG_EXTICR1_EXTI0_PE              0x0004U                         
#define SYSCFG_EXTICR1_EXTI0_PF              0x0005U                         
#define SYSCFG_EXTICR1_EXTI0_PG              0x0006U                         
#define SYSCFG_EXTICR1_EXTI0_PH              0x0007U                         
#define SYSCFG_EXTICR1_EXTI0_PI              0x0008U                         

/**
  *    EXTI1 configuration  
  */
#define SYSCFG_EXTICR1_EXTI1_PA              0x0000U                         
#define SYSCFG_EXTICR1_EXTI1_PB              0x0010U                         
#define SYSCFG_EXTICR1_EXTI1_PC              0x0020U                         
#define SYSCFG_EXTICR1_EXTI1_PD              0x0030U                         
#define SYSCFG_EXTICR1_EXTI1_PE              0x0040U                         
#define SYSCFG_EXTICR1_EXTI1_PF              0x0050U                         
#define SYSCFG_EXTICR1_EXTI1_PG              0x0060U                         
#define SYSCFG_EXTICR1_EXTI1_PH              0x0070U                         
#define SYSCFG_EXTICR1_EXTI1_PI              0x0080U                         

/**
  *    EXTI2 configuration  
  */
#define SYSCFG_EXTICR1_EXTI2_PA              0x0000U                         
#define SYSCFG_EXTICR1_EXTI2_PB              0x0100U                         
#define SYSCFG_EXTICR1_EXTI2_PC              0x0200U                         
#define SYSCFG_EXTICR1_EXTI2_PD              0x0300U                         
#define SYSCFG_EXTICR1_EXTI2_PE              0x0400U                         
#define SYSCFG_EXTICR1_EXTI2_PF              0x0500U                         
#define SYSCFG_EXTICR1_EXTI2_PG              0x0600U                         
#define SYSCFG_EXTICR1_EXTI2_PH              0x0700U                         
#define SYSCFG_EXTICR1_EXTI2_PI              0x0800U                         

/**
  *    EXTI3 configuration  
  */
#define SYSCFG_EXTICR1_EXTI3_PA              0x0000U                         
#define SYSCFG_EXTICR1_EXTI3_PB              0x1000U                         
#define SYSCFG_EXTICR1_EXTI3_PC              0x2000U                          
#define SYSCFG_EXTICR1_EXTI3_PD              0x3000U                          
#define SYSCFG_EXTICR1_EXTI3_PE              0x4000U                          
#define SYSCFG_EXTICR1_EXTI3_PF              0x5000U                          
#define SYSCFG_EXTICR1_EXTI3_PG              0x6000U                          
#define SYSCFG_EXTICR1_EXTI3_PH              0x7000U                          
#define SYSCFG_EXTICR1_EXTI3_PI              0x8000U                          

