sownlee/MCAL/env/STM32F407VG/header/Header_SYSTEM.h
/*****************  Bit definition for SYSCFG_EXTICR2 register  ***************/
#define SYSCFG_EXTICR2_EXTI4_Pos             (0U)                              
#define SYSCFG_EXTICR2_EXTI4_Msk             (0xFUL << SYSCFG_EXTICR2_EXTI4_Pos) 
#define SYSCFG_EXTICR2_EXTI4                 SYSCFG_EXTICR2_EXTI4_Msk          
#define SYSCFG_EXTICR2_EXTI5_Pos             (4U)                              
#define SYSCFG_EXTICR2_EXTI5_Msk             (0xFUL << SYSCFG_EXTICR2_EXTI5_Pos) 
#define SYSCFG_EXTICR2_EXTI5                 SYSCFG_EXTICR2_EXTI5_Msk          
#define SYSCFG_EXTICR2_EXTI6_Pos             (8U)                              
#define SYSCFG_EXTICR2_EXTI6_Msk             (0xFUL << SYSCFG_EXTICR2_EXTI6_Pos) 
#define SYSCFG_EXTICR2_EXTI6                 SYSCFG_EXTICR2_EXTI6_Msk          
#define SYSCFG_EXTICR2_EXTI7_Pos             (12U)                             
#define SYSCFG_EXTICR2_EXTI7_Msk             (0xFUL << SYSCFG_EXTICR2_EXTI7_Pos) 
#define SYSCFG_EXTICR2_EXTI7                 SYSCFG_EXTICR2_EXTI7_Msk          

/**
  *    EXTI4 configuration  
  */
#define SYSCFG_EXTICR2_EXTI4_PA              0x0000U                         
#define SYSCFG_EXTICR2_EXTI4_PB              0x0001U                         
#define SYSCFG_EXTICR2_EXTI4_PC              0x0002U                         
#define SYSCFG_EXTICR2_EXTI4_PD              0x0003U                         
#define SYSCFG_EXTICR2_EXTI4_PE              0x0004U                         
#define SYSCFG_EXTICR2_EXTI4_PF              0x0005U                         
#define SYSCFG_EXTICR2_EXTI4_PG              0x0006U                         
#define SYSCFG_EXTICR2_EXTI4_PH              0x0007U                         
#define SYSCFG_EXTICR2_EXTI4_PI              0x0008U                         

/**
  *    EXTI5 configuration  
  */
#define SYSCFG_EXTICR2_EXTI5_PA              0x0000U                         
#define SYSCFG_EXTICR2_EXTI5_PB              0x0010U                         
#define SYSCFG_EXTICR2_EXTI5_PC              0x0020U                         
#define SYSCFG_EXTICR2_EXTI5_PD              0x0030U                         
#define SYSCFG_EXTICR2_EXTI5_PE              0x0040U                         
#define SYSCFG_EXTICR2_EXTI5_PF              0x0050U                         
#define SYSCFG_EXTICR2_EXTI5_PG              0x0060U                         
#define SYSCFG_EXTICR2_EXTI5_PH              0x0070U                         
#define SYSCFG_EXTICR2_EXTI5_PI              0x0080U                         

/**
  *    EXTI6 configuration  
  */
#define SYSCFG_EXTICR2_EXTI6_PA              0x0000U                         
#define SYSCFG_EXTICR2_EXTI6_PB              0x0100U                         
#define SYSCFG_EXTICR2_EXTI6_PC              0x0200U                         
#define SYSCFG_EXTICR2_EXTI6_PD              0x0300U                         
#define SYSCFG_EXTICR2_EXTI6_PE              0x0400U                         
#define SYSCFG_EXTICR2_EXTI6_PF              0x0500U                         
#define SYSCFG_EXTICR2_EXTI6_PG              0x0600U                         
#define SYSCFG_EXTICR2_EXTI6_PH              0x0700U                         
#define SYSCFG_EXTICR2_EXTI6_PI              0x0800U                         

/**
  *    EXTI7 configuration  
  */
#define SYSCFG_EXTICR2_EXTI7_PA              0x0000U                       
#define SYSCFG_EXTICR2_EXTI7_PB              0x1000U                       
#define SYSCFG_EXTICR2_EXTI7_PC              0x2000U                       
#define SYSCFG_EXTICR2_EXTI7_PD              0x3000U                       
#define SYSCFG_EXTICR2_EXTI7_PE              0x4000U                       
#define SYSCFG_EXTICR2_EXTI7_PF              0x5000U                       
#define SYSCFG_EXTICR2_EXTI7_PG              0x6000U                       
#define SYSCFG_EXTICR2_EXTI7_PH              0x7000U                       
#define SYSCFG_EXTICR2_EXTI7_PI              0x8000U                       

/*****************  Bit definition for SYSCFG_EXTICR3 register  ***************/
#define SYSCFG_EXTICR3_EXTI8_Pos             (0U)                              
#define SYSCFG_EXTICR3_EXTI8_Msk             (0xFUL << SYSCFG_EXTICR3_EXTI8_Pos) 
#define SYSCFG_EXTICR3_EXTI8                 SYSCFG_EXTICR3_EXTI8_Msk          
#define SYSCFG_EXTICR3_EXTI9_Pos             (4U)                              
#define SYSCFG_EXTICR3_EXTI9_Msk             (0xFUL << SYSCFG_EXTICR3_EXTI9_Pos) 
#define SYSCFG_EXTICR3_EXTI9                 SYSCFG_EXTICR3_EXTI9_Msk         
#define SYSCFG_EXTICR3_EXTI10_Pos            (8U)                              
#define SYSCFG_EXTICR3_EXTI10_Msk            (0xFUL << SYSCFG_EXTICR3_EXTI10_Pos) 
#define SYSCFG_EXTICR3_EXTI10                SYSCFG_EXTICR3_EXTI10_Msk        
#define SYSCFG_EXTICR3_EXTI11_Pos            (12U)                             
#define SYSCFG_EXTICR3_EXTI11_Msk            (0xFUL << SYSCFG_EXTICR3_EXTI11_Pos) 
#define SYSCFG_EXTICR3_EXTI11                SYSCFG_EXTICR3_EXTI11_Msk        

/**
  *    EXTI8 configuration  
  */
#define SYSCFG_EXTICR3_EXTI8_PA              0x0000U                         
#define SYSCFG_EXTICR3_EXTI8_PB              0x0001U                         
#define SYSCFG_EXTICR3_EXTI8_PC              0x0002U                         
#define SYSCFG_EXTICR3_EXTI8_PD              0x0003U                         
#define SYSCFG_EXTICR3_EXTI8_PE              0x0004U                         
#define SYSCFG_EXTICR3_EXTI8_PF              0x0005U                         
#define SYSCFG_EXTICR3_EXTI8_PG              0x0006U                         
#define SYSCFG_EXTICR3_EXTI8_PH              0x0007U                         
#define SYSCFG_EXTICR3_EXTI8_PI              0x0008U                         

/**
  *    EXTI9 configuration  
  */
#define SYSCFG_EXTICR3_EXTI9_PA              0x0000U                         
#define SYSCFG_EXTICR3_EXTI9_PB              0x0010U                         
#define SYSCFG_EXTICR3_EXTI9_PC              0x0020U                         
#define SYSCFG_EXTICR3_EXTI9_PD              0x0030U                         
#define SYSCFG_EXTICR3_EXTI9_PE              0x0040U                         
#define SYSCFG_EXTICR3_EXTI9_PF              0x0050U                         
#define SYSCFG_EXTICR3_EXTI9_PG              0x0060U                         
#define SYSCFG_EXTICR3_EXTI9_PH              0x0070U                         
#define SYSCFG_EXTICR3_EXTI9_PI              0x0080U                         

/**
  *    EXTI10 configuration  
  */
#define SYSCFG_EXTICR3_EXTI10_PA             0x0000U                         
#define SYSCFG_EXTICR3_EXTI10_PB             0x0100U                         
#define SYSCFG_EXTICR3_EXTI10_PC             0x0200U                         
#define SYSCFG_EXTICR3_EXTI10_PD             0x0300U                         
#define SYSCFG_EXTICR3_EXTI10_PE             0x0400U                         
#define SYSCFG_EXTICR3_EXTI10_PF             0x0500U                         
#define SYSCFG_EXTICR3_EXTI10_PG             0x0600U                         
#define SYSCFG_EXTICR3_EXTI10_PH             0x0700U                         
#define SYSCFG_EXTICR3_EXTI10_PI             0x0800U                         

/**
  *    EXTI11 configuration  
  */
#define SYSCFG_EXTICR3_EXTI11_PA             0x0000U                         
#define SYSCFG_EXTICR3_EXTI11_PB             0x1000U                         
#define SYSCFG_EXTICR3_EXTI11_PC             0x2000U                         
#define SYSCFG_EXTICR3_EXTI11_PD             0x3000U                         
#define SYSCFG_EXTICR3_EXTI11_PE             0x4000U                         
#define SYSCFG_EXTICR3_EXTI11_PF             0x5000U                         
#define SYSCFG_EXTICR3_EXTI11_PG             0x6000U                         
#define SYSCFG_EXTICR3_EXTI11_PH             0x7000U                         
#define SYSCFG_EXTICR3_EXTI11_PI             0x8000U                         

/*****************  Bit definition for SYSCFG_EXTICR4 register  ***************/
#define SYSCFG_EXTICR4_EXTI12_Pos            (0U)                              
#define SYSCFG_EXTICR4_EXTI12_Msk            (0xFUL << SYSCFG_EXTICR4_EXTI12_Pos)
#define SYSCFG_EXTICR4_EXTI12                SYSCFG_EXTICR4_EXTI12_Msk        
#define SYSCFG_EXTICR4_EXTI13_Pos            (4U)                              
#define SYSCFG_EXTICR4_EXTI13_Msk            (0xFUL << SYSCFG_EXTICR4_EXTI13_Pos) 
#define SYSCFG_EXTICR4_EXTI13                SYSCFG_EXTICR4_EXTI13_Msk        
#define SYSCFG_EXTICR4_EXTI14_Pos            (8U)                              
#define SYSCFG_EXTICR4_EXTI14_Msk            (0xFUL << SYSCFG_EXTICR4_EXTI14_Pos) 
#define SYSCFG_EXTICR4_EXTI14                SYSCFG_EXTICR4_EXTI14_Msk         
#define SYSCFG_EXTICR4_EXTI15_Pos            (12U)                             
#define SYSCFG_EXTICR4_EXTI15_Msk            (0xFUL << SYSCFG_EXTICR4_EXTI15_Pos) 
#define SYSCFG_EXTICR4_EXTI15                SYSCFG_EXTICR4_EXTI15_Msk        

/**
  *    EXTI12 configuration  
  */
#define SYSCFG_EXTICR4_EXTI12_PA             0x0000U                       
#define SYSCFG_EXTICR4_EXTI12_PB             0x0001U                       
#define SYSCFG_EXTICR4_EXTI12_PC             0x0002U                       
#define SYSCFG_EXTICR4_EXTI12_PD             0x0003U                       
#define SYSCFG_EXTICR4_EXTI12_PE             0x0004U                       
#define SYSCFG_EXTICR4_EXTI12_PF             0x0005U                       
#define SYSCFG_EXTICR4_EXTI12_PG             0x0006U                       
#define SYSCFG_EXTICR4_EXTI12_PH             0x0007U                       

/**
  *    EXTI13 configuration  
  */
#define SYSCFG_EXTICR4_EXTI13_PA             0x0000U                       
#define SYSCFG_EXTICR4_EXTI13_PB             0x0010U                       
#define SYSCFG_EXTICR4_EXTI13_PC             0x0020U                       
#define SYSCFG_EXTICR4_EXTI13_PD             0x0030U                       
#define SYSCFG_EXTICR4_EXTI13_PE             0x0040U                       
#define SYSCFG_EXTICR4_EXTI13_PF             0x0050U                       
#define SYSCFG_EXTICR4_EXTI13_PG             0x0060U                       
#define SYSCFG_EXTICR4_EXTI13_PH             0x0070U                       

/**
  *    EXTI14 configuration  
  */
#define SYSCFG_EXTICR4_EXTI14_PA             0x0000U                       
#define SYSCFG_EXTICR4_EXTI14_PB             0x0100U                       
#define SYSCFG_EXTICR4_EXTI14_PC             0x0200U                       
#define SYSCFG_EXTICR4_EXTI14_PD             0x0300U                       
#define SYSCFG_EXTICR4_EXTI14_PE             0x0400U                       
#define SYSCFG_EXTICR4_EXTI14_PF             0x0500U                       
#define SYSCFG_EXTICR4_EXTI14_PG             0x0600U                       
#define SYSCFG_EXTICR4_EXTI14_PH             0x0700U                       

/**
  *    EXTI15 configuration  
  */
#define SYSCFG_EXTICR4_EXTI15_PA             0x0000U                      
#define SYSCFG_EXTICR4_EXTI15_PB             0x1000U                      
#define SYSCFG_EXTICR4_EXTI15_PC             0x2000U                      
#define SYSCFG_EXTICR4_EXTI15_PD             0x3000U                      
#define SYSCFG_EXTICR4_EXTI15_PE             0x4000U                      
#define SYSCFG_EXTICR4_EXTI15_PF             0x5000U                      
#define SYSCFG_EXTICR4_EXTI15_PG             0x6000U                      
#define SYSCFG_EXTICR4_EXTI15_PH             0x7000U                      

/******************  Bit definition for SYSCFG_CMPCR register  ****************/
#define SYSCFG_CMPCR_CMP_PD_Pos              (0U)                              
#define SYSCFG_CMPCR_CMP_PD_Msk              (0x1UL << SYSCFG_CMPCR_CMP_PD_Pos) 
#define SYSCFG_CMPCR_CMP_PD                  SYSCFG_CMPCR_CMP_PD_Msk          
#define SYSCFG_CMPCR_READY_Pos               (8U)                             
#define SYSCFG_CMPCR_READY_Msk               (0x1UL << SYSCFG_CMPCR_READY_Pos) 
#define SYSCFG_CMPCR_READY                   SYSCFG_CMPCR_READY_Msk   

#endif  /* HEADER_SYSTEM_H_ */
